
public class Feature {
	
	//멤버변수  - 인스턴스 변수 : 객체생성 이후에 메모리 할당
	//						int iv
	//클래스(Static) 변수 : 객체생성 없이 메모리에 할당, 객체들이 공유한다, 클래스이름.변수명
	//						static int cv
	//생성자 - 멤버변수의 초기화 (인스턴스 변수) 초기화, 기본생성자, 일반생성자, 생성자 오버로딩(이름이같은 생성자)
	//		 클래스의이름() {} -> Feature() {}
								
	//메소드 - 특정기능을 반복적으로 사용하기 위해 정의한 형식, 코드의 재사용 및 반복의 최소화
	//		 인스턴스 메소드	: 객체 생성 이후에 메모리 할당
	//					  void add() {}
	//		 클래스 메소드	: 객체 생성 없이 메모리 할당, 클래스이름.메소드명()
	//					  static void add() {}
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
